//  -  -  -  -  -  -  -  -  -  -  -  -  -
// 운영자가 방 생성하면, 앱을 사용하는 모든 사람들에게
// 방이 열렸다고 알림을 보낼 수 있는지.
// 아까 페이지 말고 코드만 만져가지고
// 코드만 가지고 하는 방법이 구독이다.
//  -  -  -  -  -  -

//----------------------------------------------
//-------------------------------------
//-------------------------
//------------

//코드상에서 인앱 에서 해야 한다.

//게시물등록할 파이어베이스 펑션이용해서 fcm을 날려야 한다.
// 앱 사용하는 모든 사람 -(주제 구독 다 시켜두고 구독 한 사람)
//-------------------------

//앱을 키면 구독을 전체 유저로 시켜두고

//채팅방 방법
//채팅방에서 채팅 백그라운드로 메시지오는것도 같은이치다

// 채팅보낼때 fcm도 상대방 토큰에 같이 보낸다.
//토큰도 같이 보내게 해야 한다. 센드하면 펑션 사용해서 토큰과 데이터를 실어서 같이 보낸다.

//=======================================

//  프린트로 로그 계속 찍어봐서 어디가 문젠지 확인해야 한다.
// 1->2->3,4 머릿속 구상이 안되는데, 에러도 안남 ㅡ 알림만 안옴

//토큰 말고 구독하는 방법이 있다.
//구독이 되있으면 구독이 된 기기에 알람이 간다.

//주제가 있으면 주제 구독을 해두면 거기에 맞춰서 온다.
// 당근 커뮤니티에 노래, 볼링등의 단체 푸쉬

// 토큰과 주제구독으로 해보기

//(주제 구독은 토큰 필요 없을 수도..)
//토큰 안쓰고 하는게 구독일수도...
//
